## ğŸ“‚ count() í•¨ìˆ˜

count()ëŠ” NaN ê°’ì„ ì œì™¸í•œ ë°ì´í„°ì˜ ê°œìˆ˜ë¥¼ ì„¸ëŠ” í•¨ìˆ˜ì´ë‹¤.

Seriesì— count() í•¨ìˆ˜ë¥¼ ì ìš©í•˜ë©´ NaN ê°’ì„ ì œì™¸í•œ ë°ì´í„°ì˜ ê°œìˆ˜ë¥¼ ì…€ ìˆ˜ ìˆë‹¤.

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [2]:
import numpy as np
import pandas as pd

In [3]:
s1 = pd.Series(range(10))
s1[3] = np.NaN
s1

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
s1.count()

9

DataFrameì— count() í•¨ìˆ˜ë¥¼ ì ìš©í•˜ë©´ NaN ê°’ì„ ì œì™¸í•œ ê° ì»¬ëŸ¼ ë³„ ë°ì´í„°ì˜ ê°œìˆ˜ë¥¼ ì…€ ìˆ˜ ìˆë‹¤.

In [5]:
np.random.seed(3)
df1 = pd.DataFrame(np.random.randint(5, size=(4, 4)))
df1.iloc[2, 3] = np.NaN
df1

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [6]:
df1.count()

0    4
1    4
2    4
3    3
dtype: int64

axis íŒŒë¼ë¯¸í„°ëŠ” ë””í´íŠ¸ ê°’ì´ 0ì´ë©° ê° ì—´ì˜ ë°ì´í„° ê°œìˆ˜ë¥¼ ì§‘ê³„í•œë‹¤.<br>
axis íŒŒë¼ë¯¸í„°ê°€ 1ì´ë¼ë©´ ê° í–‰ì˜ ë°ì´í„° ê°œìˆ˜ë¥¼ ì§‘ê³„í•œë‹¤.

In [7]:
df1.count(axis=1)

0    4
1    4
2    3
3    4
dtype: int64

ì•„ë˜ì˜ íƒ€ì´íƒ€ë‹‰ ì˜ˆì œë¥¼ ì‚´í´ë³´ë©´ age, deck ì»¬ëŸ¼ì— ë§ì€ ê²°ì¸¡ì¹˜ê°€ ì¡´ì¬í•¨ì„ ì•Œ ìˆ˜ ìˆë‹¤.

In [1]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

---

## ğŸ“‚ value_counts() í•¨ìˆ˜

value_counts()ëŠ” Seriesì˜ ê°’ì´ ì •ìˆ˜, ë¬¸ìì—´, ì¹´í…Œê³ ë¦¬ ê°’ì¸ ê²½ìš° ê°ê°ì˜ ê°’ì´ ë‚˜ì˜¨ íšŸìˆ˜ë¥¼ ì…€ ìˆ˜ ìˆë‹¤.

In [10]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))

s2.head()
s2.tail()
len(s2)

0    5
1    3
2    4
3    0
4    1
dtype: int32

95    4
96    5
97    2
98    4
99    3
dtype: int32

100

In [11]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

DataFrameì˜ ê° ì»¬ëŸ¼ë„ Seriesì´ë¯€ë¡œ value_counts() í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•  ìˆ˜ ìˆë‹¤.<br>
normalize íŒŒë¼ë¯¸í„°ëŠ” ì •ê·œí™” ì—¬ë¶€ë¥¼ ì„¤ì •í•˜ëŠ” ê²ƒì´ë‹¤.

In [12]:
titanic['sex'].value_counts()
titanic['sex'].value_counts(normalize=True)
titanic['sex'].value_counts(normalize=True) * 100

male      577
female    314
Name: sex, dtype: int64

male      0.647587
female    0.352413
Name: sex, dtype: float64

male      64.758698
female    35.241302
Name: sex, dtype: float64

In [13]:
titanic['alive'].value_counts()
titanic['alive'].value_counts(normalize=True)
titanic['alive'].value_counts(normalize=True) * 100

no     549
yes    342
Name: alive, dtype: int64

no     0.616162
yes    0.383838
Name: alive, dtype: float64

no     61.616162
yes    38.383838
Name: alive, dtype: float64

DataFrameì—ë„ value_counts() í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•  ìˆ˜ ìˆë‹¤.<br>
ì´ ê²½ìš° í•˜ë‚˜ì˜ í–‰ ìì²´ë¥¼ í•˜ë‚˜ì˜ ê°’ìœ¼ë¡œ ê°„ì£¼í•˜ê³  ë™ì¼í•œ í–‰ì´ ëª‡ ë²ˆ ë‚˜íƒ€ë‚˜ëŠ”ì§€ë¥¼ ë°˜í™˜í•œë‹¤.

In [14]:
titanic[['sex', 'alive']]

        sex alive
0      male    no
1    female   yes
2    female   yes
3    female   yes
4      male    no
..      ...   ...
886    male    no
887  female   yes
888  female    no
889    male   yes
890    male    no

[891 rows x 2 columns]

In [15]:
titanic[['sex', 'alive']].value_counts()

sex     alive
male    no       468
female  yes      233
male    yes      109
female  no        81
dtype: int64

In [16]:
pd.DataFrame(titanic[['sex', 'alive']].value_counts())

                0
sex    alive
male   no     468
female yes    233
male   yes    109
female no      81

---

## ğŸ“‚ sort_index() Â· sort_value() í•¨ìˆ˜

sort_index() í•¨ìˆ˜ëŠ” ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [17]:
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [18]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [19]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

sort_index() í•¨ìˆ˜ëŠ” ê¸°ë³¸ì ìœ¼ë¡œ ì˜¤ë¦„ì°¨ìˆœìœ¼ë¡œ ì •ë ¬ëœë‹¤.<br>
ë‚´ë¦¼ì°¨ìˆœìœ¼ë¡œ ì •ë ¬í•˜ê³  ì‹¶ë‹¤ë©´ ascending íŒŒë¼ë¯¸í„°ë¥¼ Falseë¡œ ì„¤ì •í•˜ë©´ ëœë‹¤.

In [20]:
s2.value_counts().sort_index(ascending=False)

5    16
4    17
3    14
2    13
1    22
0    18
dtype: int64

sort_value() í•¨ìˆ˜ëŠ” ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [21]:
s2.value_counts().sort_values()

2    13
3    14
5    16
4    17
0    18
1    22
dtype: int64

In [22]:
s2.value_counts().sort_values(ascending=False)

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

DataFrameì—ì„œë„ sort_index() í•¨ìˆ˜ë¥¼ ë˜‘ê°™ì´ ì ìš©ì‹œí‚¬ ìˆ˜ ìˆë‹¤.

In [23]:
df1

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [24]:
df1.sort_index()

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [25]:
df1.sort_index(ascending=False)

   0  1  2    3
3  2  0  4  4.0
2  2  3  1  NaN
1  0  0  0  3.0
0  2  0  1  3.0

DataFrameì—ì„œì˜ sort_index() í•¨ìˆ˜ëŠ” íŠ¹ì • ì»¬ëŸ¼ ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬í•œë‹¤.<br>
DataFrameì€ 2ì°¨ì› ë°°ì—´ê³¼ ë™ì¼í•˜ê¸° ë•Œë¬¸ì— ì •ë ¬ì‹œ ê¸°ì¤€ ì»¬ëŸ¼ì„ í•„ìˆ˜ì ìœ¼ë¡œ ì§€ì •í•´ì•¼í•œë‹¤.<br>
by = ê¸°ì¤€ ì»¬ëŸ¼ëª…, by = [ê¸°ì¤€ ì»¬ëŸ¼ëª…1, ê¸°ì¤€ ì»¬ëŸ¼ëª…2, ...]ê³¼ ê°™ì´ ê¸°ì¤€ ì»¬ëŸ¼ì„ ì§€ì •í•  ìˆ˜ ìˆë‹¤.

In [26]:
df1.sort_values(by=0)

   0  1  2    3
1  0  0  0  3.0
0  2  0  1  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [27]:
df1.sort_values(by=0, ascending=False)

   0  1  2    3
0  2  0  1  3.0
2  2  3  1  NaN
3  2  0  4  4.0
1  0  0  0  3.0

In [28]:
df1.sort_values(by=[0, 1], ascending=False)

   0  1  2    3
2  2  3  1  NaN
0  2  0  1  3.0
3  2  0  4  4.0
1  0  0  0  3.0

---

## ğŸ“‚ sum() í•¨ìˆ˜

sum() í•¨ìˆ˜ëŠ” í–‰ ë˜ëŠ” ì—´ì˜ í•©ê³„ë¥¼ êµ¬í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [29]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

íŒŒë¼ë¯¸í„° axisë¥¼ 0ìœ¼ë¡œ ì„¤ì •í•˜ë©´ ì—´ì˜ í•©ê³„ë¥¼ êµ¬í• ìˆ˜ ìˆë‹¤.<br>
íŒŒë¼ë¯¸í„° axisë¥¼ 1ë¡œ ì„¤ì •í•˜ë©´ í–‰ì˜ í•©ê³„ë¥¼ êµ¬í•  ìˆ˜ ìˆë‹¤.

In [30]:
df2.sum(axis=0)

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [31]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [32]:
df2['RowSum'] = df2.sum(axis=1) # ì—¬ëŸ¬ ë²ˆ ì‹¤í–‰ì‹œ RowSum ê°’ì´ ëˆ„ì ë˜ì–´ ì˜ëª»ëœ ê²°ê³¼ê°€ ë°œìƒí•œë‹¤
df2['RowSum'] = df2[[0, 1, 2, 3, 4, 5, 6, 7]].sum(axis=1) # ëª…ì‹œì ìœ¼ë¡œ ì§€ì •í•˜ëŠ” ê²ƒì´ ë” ë°”ëŒì§í•œ ê²½ìš°ë„ ìˆë‹¤
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

---

## ğŸ“‚ mean() Â· min() Â· max() í•¨ìˆ˜

In [33]:
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

mean() í•¨ìˆ˜ëŠ” í‰ê·  ê°’ì„ êµ¬í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [34]:
df2.mean(axis=0)
df2.mean(axis=1)

0          6.00
1          8.25
2          6.25
3          6.00
4          3.75
5          2.50
6          1.25
7          4.00
RowSum    38.00
dtype: float64

0    7.777778
1    7.555556
2    9.111111
3    9.333333
dtype: float64

min() í•¨ìˆ˜ëŠ” ìµœì†Œê°’ì„ êµ¬í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [35]:
df2.min(axis=0)
df2.min(axis=1)

0          4
1          7
2          2
3          4
4          0
5          0
6          0
7          1
RowSum    34
dtype: int64

0    0
1    2
2    0
3    0
dtype: int64

max() í•¨ìˆ˜ëŠ” ìµœëŒ€ê°’ì„ êµ¬í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [36]:
df2.max(axis=0)
df2.max(axis=1)

0          9
1          9
2          9
3          9
4          9
5          7
6          4
7          7
RowSum    42
dtype: int64

0    35
1    34
2    41
3    42
dtype: int64

mean() Â· min() Â· max() í•¨ìˆ˜ë¥¼ ë‹¤ìŒê³¼ ê°™ì´ í™œìš©í•  ìˆ˜ ìˆë‹¤.

In [37]:
df2.loc['ColTotal'] = df2.max(axis=0)
df2

          0  1  2  3  4  5  6  7  RowSum
0         5  8  9  5  0  0  1  7      35
1         6  9  2  4  5  2  4  2      34
2         4  7  7  9  1  7  0  6      41
3         9  9  7  6  9  1  0  1      42
ColTotal  9  9  9  9  9  7  4  7      42

---

## ğŸ“‚ NaN ê°’ ì²˜ë¦¬ í•¨ìˆ˜

dropna() í•¨ìˆ˜ëŠ” NaN ê°’ì´ ìˆëŠ” í–‰ ë˜ëŠ” ì—´ì„ ì‚­ì œí•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [38]:
df2

          0  1  2  3  4  5  6  7  RowSum
0         5  8  9  5  0  0  1  7      35
1         6  9  2  4  5  2  4  2      34
2         4  7  7  9  1  7  0  6      41
3         9  9  7  6  9  1  0  1      42
ColTotal  9  9  9  9  9  7  4  7      42

In [39]:
df2.iloc[0, 0] = np.NaN
df2

            0  1  2  3  4  5  6  7  RowSum
0         NaN  8  9  5  0  0  1  7      35
1         6.0  9  2  4  5  2  4  2      34
2         4.0  7  7  9  1  7  0  6      41
3         9.0  9  7  6  9  1  0  1      42
ColTotal  9.0  9  9  9  9  7  4  7      42

íŒŒë¼ë¯¸í„° axisê°€ 0ì´ë¼ë©´ NaN ê°’ì´ í¬í•¨ëœ í–‰ì„ ì‚­ì œí•œë‹¤.

In [40]:
df2.dropna(axis=0)

            0  1  2  3  4  5  6  7  RowSum
1         6.0  9  2  4  5  2  4  2      34
2         4.0  7  7  9  1  7  0  6      41
3         9.0  9  7  6  9  1  0  1      42
ColTotal  9.0  9  9  9  9  7  4  7      42

íŒŒë¼ë¯¸í„° axisê°€ 1ì´ë¼ë©´ NaN ê°’ì´ í¬í•¨ëœ ì—´ì„ ì‚­ì œí•œë‹¤.

In [41]:
df2.dropna(axis=1)

          1  2  3  4  5  6  7  RowSum
0         8  9  5  0  0  1  7      35
1         9  2  4  5  2  4  2      34
2         7  7  9  1  7  0  6      41
3         9  7  6  9  1  0  1      42
ColTotal  9  9  9  9  7  4  7      42

fillna() í•¨ìˆ˜ëŠ” NaN ê°’ì„ ì •í•´ì§„ ë°ì´í„°ë¡œ ì±„ìš°ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [42]:
df2.fillna(999)

              0  1  2  3  4  5  6  7  RowSum
0         999.0  8  9  5  0  0  1  7      35
1           6.0  9  2  4  5  2  4  2      34
2           4.0  7  7  9  1  7  0  6      41
3           9.0  9  7  6  9  1  0  1      42
ColTotal    9.0  9  9  9  9  7  4  7      42

In [43]:
df2.fillna(999).astype(int)

            0  1  2  3  4  5  6  7  RowSum
0         999  8  9  5  0  0  1  7      35
1           6  9  2  4  5  2  4  2      34
2           4  7  7  9  1  7  0  6      41
3           9  9  7  6  9  1  0  1      42
ColTotal    9  9  9  9  9  7  4  7      42

dropna() Â· fillna() í•¨ìˆ˜ëŠ” ì›ë³¸ ë°˜ì˜ì´ ë˜ì§€ ì•Šìœ¼ë¯€ë¡œ ì›ë³¸ ë°˜ì˜ì„ ìœ„í•´ì„œëŠ” íŒŒë¼ë¯¸í„° inplaceë¥¼ Trueë¡œ ì„¤ì •í•´ì•¼í•œë‹¤.

---

## ğŸ“‚ apply() í•¨ìˆ˜

apply()ëŠ” í–‰ê³¼ ì—´ì— ë²¡í„°í™” ì—°ì‚°ì„ í•  ìˆ˜ ìˆë„ë¡ í•´ì£¼ëŠ” í•¨ìˆ˜ì´ë‹¤.<br>
ì¼ë°˜ì ìœ¼ë¡œ ë³µì¡í•œ ì—°ì‚°ì„ í•´ê²°í•˜ê¸° ìœ„í•œ lambda í•¨ìˆ˜ë‚˜ ì‚¬ìš©ì ì •ì˜ í•¨ìˆ˜ë¥¼ ê° Row ë˜ëŠ” Columnì— ì¼ê´„ ì ìš©ì‹œí‚¤ê¸° ìœ„í•´ ì‚¬ìš©í•œë‹¤.<br>
DataFrameì˜ ê¸°ë³¸ í•¨ìˆ˜(sum, mean, min, max ë“±)ë“¤ì€ í–‰ ë° ì—´ ë‹¨ìœ„ ë²¡í„°í™” ì—°ì‚°ì„ ìˆ˜í–‰í•˜ê¸° ë•Œë¬¸ì— apply() í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•  í•„ìš”ê°€ ì—†ë‹¤.

In [44]:
df3 = pd.DataFrame({
    'a':[1, 3, 4, 3, 4],
    'b':[2, 3, 1, 4, 5],
    'c':[1, 5, 2, 4, 4]
})

df3

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

In [45]:
df3[['a', 'b']].apply(np.square)

    a   b
0   1   4
1   9   9
2  16   1
3   9  16
4  16  25

ì‚¬ìš©ì ì •ì˜ í•¨ìˆ˜ë¥¼ apply() í•¨ìˆ˜ì— ì‚¬ìš©í•  ìˆ˜ ìˆë‹¤.

axis íŒŒë¼ë¯¸í„°ëŠ” 0ì´ ë””í´íŠ¸ ê°’ì´ë©° ì—´ ë‹¨ìœ„ë¡œ í•¨ìˆ˜ë¥¼ ì ìš©í•œë‹¤.<br>
axis íŒŒë¼ë¯¸í„°ê°€ 1ì´ë¼ë©´ í–‰ ë‹¨ìœ„ë¡œ í•¨ìˆ˜ë¥¼ ì ìš©í•œë‹¤.

In [46]:
def diff(x):
    return x.max() - x.min()

In [47]:
df3.apply(diff, axis=0)

a    3
b    4
c    4
dtype: int64

ì•„ë˜ì™€ ê°™ì´ 1íšŒì„± í•¨ìˆ˜ lambda í•¨ìˆ˜ ë˜í•œ apply() í•¨ìˆ˜ì— ì‚¬ìš©í•  ìˆ˜ ìˆë‹¤.

In [48]:
df3.apply(lambda x:np.square(x) if x.name in ['a', 'b'] else x, axis=0)

    a   b  c
0   1   4  1
1   9   9  5
2  16   1  2
3   9  16  4
4  16  25  4

---

## ğŸ“‚ cut() Â· pcut() í•¨ìˆ˜

cut() í•¨ìˆ˜ì™€ pcut() í•¨ìˆ˜ë¥¼ ì´ìš©í•´ ìˆ˜ì¹˜í˜• ë°ì´í„°ë“¤ì„ íŠ¹ì • êµ¬ê°„ìœ¼ë¡œ ë‚˜ëˆˆ ë²”ì£¼í˜• ë ˆì´ë¸”ì„ ìƒì„±í•  ìˆ˜ ìˆë‹¤.<br>
cut()ì€ ì •í•´ì§„ ê²½ê³„ê°’ì— ì˜í•´ ë°ì´í„°ë“¤ì„ êµ¬ê°„ë³„ë¡œ ë²”ì£¼í™”í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.<br>

In [49]:
ages = [0, 10, 15, 13, 21, 23, 37, 31, 43, 80, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 100]
labels = ['ì–´ë¦°ì´', 'ì²­ë…„', 'ì¥ë…„', 'ì¤‘ë…„', 'ë…¸ë…„']

cut = pd.cut(ages, bins, labels=labels)
cut

[NaN, 'ì–´ë¦°ì´', 'ì–´ë¦°ì´', 'ì–´ë¦°ì´', 'ì²­ë…„', ..., 'ë…¸ë…„', 'ì²­ë…„', 'ì¤‘ë…„', 'ì¥ë…„', 'ë…¸ë…„']
Length: 15
Categories (5, object): ['ì–´ë¦°ì´' < 'ì²­ë…„' < 'ì¥ë…„' < 'ì¤‘ë…„' < 'ë…¸ë…„']

qcut()ì€ cut() í•¨ìˆ˜ì™€ëŠ” ë‹¤ë¥´ê²Œ êµ¬ê°„ ë‹¹ ë²”ì£¼í™”ë˜ì–´ ìˆëŠ” ë°ì´í„°ì˜ ê°œìˆ˜ê°€ ë™ì¼í•˜ë„ë¡ ë²”ì£¼í™”í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.<br>
ê°™ì€ ë°ì´í„°ê°€ ì¡´ì¬í•  ê²½ìš°ì—ëŠ” ê°™ì€ êµ¬ê°„ìœ¼ë¡œ ì²˜ë¦¬ëœë‹¤.

In [50]:
data = [8, 15, 13,  8, 11, 18, 11,  8,  7,  2, 17, 11, 15,  5,  7,  3,  6, 4, 10, 11]
labels = ['Q1', 'Q2', 'Q3', 'Q4']

qcut = pd.qcut(data, 4, labels=labels)
qcut

['Q2', 'Q4', 'Q4', 'Q2', 'Q3', ..., 'Q1', 'Q1', 'Q1', 'Q3', 'Q3']
Length: 20
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [51]:
qcut.value_counts()

Q1    5
Q2    5
Q3    5
Q4    5
dtype: int64

---

## ğŸ“‚ ì¸ë±ìŠ¤ ì„¤ì • í•¨ìˆ˜

set_index()ëŠ” ê¸°ì¡´ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ì»¬ëŸ¼ ì¤‘ í•˜ë‚˜ë¥¼ ì¸ë±ìŠ¤ë¡œ ì„¤ì •í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [52]:
df4 = pd.DataFrame({
    'a':[1, 3, 4, 3, 4],
    'b':[2, 3, 1, 4, 5],
    'c':[1, 5, 2, 4, 4]
})

df4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

In [53]:
df4.set_index('a')
df4

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

inplace íŒŒë¼ë¯¸í„°ëŠ” ë””í´íŠ¸ ê°’ì´ Falseì´ë©° set_index() í•¨ìˆ˜ì˜ ìˆ˜í–‰ ë‚´ìš©ì´ ì›ë³¸ì— ë°˜ì˜ë˜ì§€ ì•ŠëŠ”ë‹¤.<br>
inplace íŒŒë¼ë¯¸í„°ê°€ Trueë¼ë©´ set_index() í•¨ìˆ˜ì˜ ìˆ˜í–‰ ë‚´ìš©ì´ ì›ë³¸ì— ë°˜ì˜ëœë‹¤.

In [54]:
df4.set_index('a', inplace=True)
df4

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

reset_index()ëŠ” ê¸°ì¡´ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ê¸°ë³¸ ì¸ë±ìŠ¤(0-based ì¸ë±ìŠ¤)ë¡œ ë³€ê²½í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [55]:
df4.reset_index()
df4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

drop íŒŒë¼ë¯¸í„°ë¥¼ Trueë¡œ ì„¤ì •í•˜ë©´ ê¸°ì¡´ì˜ ì¸ë±ìŠ¤ë¥¼ ë²„ë¦°ë‹¤.

In [56]:
df4.reset_index(drop=True)

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

In [57]:
df4

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

In [58]:
df4.reset_index(inplace=True)

In [59]:
df4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

---

## ğŸ“‚ ì¸ë±ìŠ¤ ì´ë¦„ ë³€ê²½ í•¨ìˆ˜

rename()ì€ ì¸ë±ìŠ¤ëª… í˜¹ì€ ì»¬ëŸ¼ëª…ì„ ë°”ê¿€ ë•Œ ì‚¬ìš©í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.<br>
ëª¨ë“  ì¸ë±ìŠ¤ëª… ë˜ëŠ” ì»¬ëŸ¼ëª…ì„ ë°”ê¿€ ë•Œ ì‚¬ìš©í•˜ê¸°ë³´ë‹¤ëŠ” ë¶€ë¶„ ì¸ë±ìŠ¤ ë˜ëŠ” ì»¬ëŸ¼ëª…ì„ ë°”ê¿€ ë•Œ ì‚¬ìš©í•œë‹¤.

In [60]:
df3.rename(index={0:'êµ­ì–´'})
df3

    a  b  c
êµ­ì–´  1  2  1
1   3  3  5
2   4  1  2
3   3  4  4
4   4  5  4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

In [61]:
df3.rename(columns={'a':'í•™ìƒ'})
df3

   í•™ìƒ  b  c
0   1  2  1
1   3  3  5
2   4  1  2
3   3  4  4
4   4  5  4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

---

## ğŸ“‚ ë¦¬ìŠ¤íŠ¸ ë‚´í¬

ë¦¬ìŠ¤íŠ¸ ë‚´í¬ for ë¬¸ì„ ì‚¬ìš©í•˜ë©´ ë¦¬ìŠ¤íŠ¸ì™€ for ë¬¸ì„ ë”°ë¡œ ì‚¬ìš©í•˜ëŠ” ê²ƒë³´ë‹¤ í›¨ì”¬ ê°„ê²°í•˜ê²Œ ì½”ë“œë¥¼ ì‘ì„±í•  ìˆ˜ ìˆë‹¤.<br>
ì‚¬ìš©ë²•ì€ ë‹¤ìŒê³¼ ê°™ë‹¤.

**list = [í‘œí˜„ì‹ for ë³€ìˆ˜ in ë°˜ë³µ ê°€ëŠ¥í•œ ëŒ€ìƒ (if ì¡°ê±´ë¬¸)]**

In [62]:
a = [1, 2, 3, 4]
result = []

for num in a:
    result.append(num * 2)

result

[2, 4, 6, 8]

In [63]:
result = [num * 2 for num in a]
result

[2, 4, 6, 8]

In [64]:
test = []

for i in range(1, 5):
    test.append('id_' + str(i))

test

['id_1', 'id_2', 'id_3', 'id_4']

In [65]:
test = ['id_' + str(i) for i in range(1, 5) if i % 2 == 0]
test

['id_2', 'id_4']